; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-99)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 - object)
 (:init 
    (arm-empty)
    (clear b14)
    (on b14 b10)
    (on b10 b25)
    (on b25 b1)
    (on b1 b13)
    (on-table b13)
    (clear b27)
    (on b27 b7)
    (on b7 b4)
    (on b4 b18)
    (on b18 b3)
    (on b3 b9)
    (on b9 b17)
    (on b17 b11)
    (on b11 b12)
    (on b12 b28)
    (on-table b28)
    (clear b26)
    (on b26 b5)
    (on b5 b22)
    (on b22 b24)
    (on-table b24)
    (clear b23)
    (on b23 b16)
    (on b16 b6)
    (on b6 b21)
    (on b21 b8)
    (on b8 b15)
    (on-table b15)
    (clear b20)
    (on b20 b29)
    (on b29 b2)
    (on b2 b19)
    (on-table b19))
 (:goal (and 
(on b12 b2)
))
)

; plan
1. (unstack b27 b7)
   deleted: (on b27 b7) (clear b27) (arm-empty)
   added: (holding b27) (clear b7)
   goals met: 0 of 1
2. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 0 of 1
3. (unstack b7 b4)
   deleted: (on b7 b4) (clear b7) (arm-empty)
   added: (holding b7) (clear b4)
   goals met: 0 of 1
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
5. (unstack b4 b18)
   deleted: (on b4 b18) (clear b4) (arm-empty)
   added: (holding b4) (clear b18)
   goals met: 0 of 1
6. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
7. (unstack b18 b3)
   deleted: (on b18 b3) (clear b18) (arm-empty)
   added: (holding b18) (clear b3)
   goals met: 0 of 1
8. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 1
9. (unstack b3 b9)
   deleted: (on b3 b9) (clear b3) (arm-empty)
   added: (holding b3) (clear b9)
   goals met: 0 of 1
10. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 1
11. (unstack b9 b17)
   deleted: (on b9 b17) (clear b9) (arm-empty)
   added: (holding b9) (clear b17)
   goals met: 0 of 1
12. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
13. (unstack b17 b11)
   deleted: (on b17 b11) (clear b17) (arm-empty)
   added: (holding b17) (clear b11)
   goals met: 0 of 1
14. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 1
15. (unstack b11 b12)
   deleted: (on b11 b12) (clear b11) (arm-empty)
   added: (holding b11) (clear b12)
   goals met: 0 of 1
16. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 1
17. (unstack b20 b29)
   deleted: (on b20 b29) (clear b20) (arm-empty)
   added: (holding b20) (clear b29)
   goals met: 0 of 1
18. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 1
19. (unstack b29 b2)
   deleted: (on b29 b2) (clear b29) (arm-empty)
   added: (holding b29) (clear b2)
   goals met: 0 of 1
20. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 0 of 1
21. (unstack b12 b28)
   deleted: (on b12 b28) (clear b12) (arm-empty)
   added: (holding b12) (clear b28)
   goals met: 0 of 1
22. (stack b12 b2)
   deleted: (clear b2) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b2)
   goals met: 1 of 1
